<?php

return [
    'task' => [
        'fields' => [
            'name' => 'Имя',
            'description' => 'Описание задачи',
            'status_id' => 'Статус задачи',
            'created_by_id' => 'Автор',
            'assigned_to_id' => 'Исполнитель',
            'labels' => 'Метки',
            'filter[status_id]' => 'Статус задачи',
            'filter[created_by_id]' => 'Автор',
            'filter[assigned_to_id]' => 'Исполнитель',
        ],
        'pages' => [
            'create' => [
                'submit' => 'Создать задачу',
                'title' => 'Создать задачу',
            ],
            'edit' => [
                'submit' => 'Изменить задачу',
                'title' => 'Изменить задачу',
            ],
            'index' => [
                'title' => 'Задачи',
                'new' => 'Создать новую задачу',
            ],
            'show' => [
                'title' => 'Задача: ',
            ],
            'filter' => [
                'submit' => 'Принять'
            ]
        ],
        'flash' => [
            'store' => 'Задача успешно создана',
            'update' => 'Задача была изменена',
            'destroy' => [
                'success' => 'Задача удалена',
                'fail' => [
                    'no-rigths' => 'Нет прав на удаление',
                ],
            ],
        ],
    ],
    'status' => [
        'fields' => [
            'name' => 'Имя',
            'description' => 'Описание статуса',
        ],
        'pages' => [
            'create' => [
                'submit' => 'Создать статус',
                'title' => 'Создать статус',
            ],
            'edit' => [
                'submit' => 'Изменить статус',
                'title' => 'Изменить статус',
            ],
            'index' => [
                'title' => 'Статусы задач',
                'new' => 'Создать новый статус',
            ],
            'show' => [
                'title' => 'Метка: ',
            ],
        ],
        'flash' => [
            'store' => 'Статус успешно создан',
            'update' => 'Статус был изменен',
            'destroy' => [
                'success' => 'Статус удален',
                'fail' => [
                    'no-rigths' => 'Нет прав на удаление',
                    'constraint' => 'Не удалось удалить статус',
                ],
            ],
        ],
    ],
    'label' => [
        'fields' => [
            'name' => 'Имя',
            'description' => 'Описание метки',
        ],
        'pages' => [
            'create' => [
                'submit' => 'Создать метку',
                'title' => 'Создать метку',
            ],
            'edit' => [
                'submit' => 'Изменить метку',
                'title' => 'Изменить метку',
            ],
            'index' => [
                'title' => 'Метки',
                'new' => 'Создать новую метку',
            ],
            'show' => [
                'title' => 'Метка: ',
            ],
        ],
        'flash' => [
            'store' => 'Метка успешно создана',
            'update' => 'Метка была изменена',
            'destroy' => [
                'success' => 'Метка удалена',
                'fail' => [
                    'no-rigths' => 'Нет прав на удаление',
                    'constraint' => 'Не удалось удалить метку',
                ],
            ],
        ],
    ],

    'delete' => 'Удалить',
];